Revit 2024 API
FabricationPartBrowserChangedEventArgs.GetRequiredFabricationPartTypeIds Method
 Returns set of required fabrication part types in use in routing solution mode.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ISet<ElementId> GetRequiredFabricationPartTypeIds()
Visual Basic
Public Function GetRequiredFabricationPartTypeIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetRequiredFabricationPartTypeIds()
Return Value
 The set of ElementIds for for required fabrication part types that is in use in routing solution mode.
See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace